'use client';
import Blog1 from '@/assets/images/blog-article-1.jpg';
import Blog2 from '@/assets/images/blog-article-2.jpg';
import Blog3 from '@/assets/images/blog-article-3.jpg';
import useStyles from './BlogList.styles';
import { BlogListElement } from './BlogListElement/BlogListElement';
import Text from '@stryberventures/gaia-react.text';

const blogs = [
  {
    id: '1',
    title: 'مستشار التمويل العقاري، فرصة، اغتنمها',
    description:
      'مستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لكمستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لكمستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لك.',
    tags: ['عقارات', 'التمويل العقاري'],
    date: '19 جماد الاول 1445',
    image: Blog1,
  },
  {
    id: '2',
    title: 'مع مايو يعبأ ارتكبها بحق, لإعلان والكوري التنازلي من جهة',
    description:
      'مستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لكمستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لكمستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لك.',
    tags: ['التمويل العقاري'],
    date: '19 جماد الاول 1445',
    image: Blog2,
  },
  {
    id: '3',
    title: 'مع مايو يعبأ ارتكبها بحق, لإعلان والكوري التنازلي من جهة',
    description:
      'مستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لكمستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لكمستشارك الخاص العقاري راح يتواصل مع كل البنوك في المملكة للحصول على أفضل عروض ممكنة تتماشى مع امكانياتك ويقدمها لك.',
    tags: ['التمويل العقاري'],
    date: '19 جماد الاول 1445',
    image: Blog3,
  },
];

export const BlogList = () => {
  const classes = useStyles();
  return (
    <>
      <Text className={classes.title}>مدونات تمويلي</Text>
      <div className={classes.blogList}>
        {blogs.map((blog) => (
          <BlogListElement key={blog.id} {...blog} />
        ))}
      </div>
    </>
  );
};
